// Получите ссылки на форму и ее поля
// const form = 
// const email = 
// const pass = 

// Добавьте обработчик события отправки формы

// Напишите функцию-обработчик отправки формы
function handleSubmit() {
    // Не забудьте отменить действие формы по умолчанию

    // проверьте, что все поля формы заполнены (если нет, выдайте предупреждение)
    // при заполненных полях вызовите функцию авторизации
    // по получению данных с "сервера" сохраните полученный токен в localStorage
    // также удалите обработчик события отправки формы и перенаправьте поситителя на главную страницу
}

// Напишите функцию авторизации
function logIn() {
    // Подготовьте fetch-запрос на 'fakeurl' методом POST
    // Не забудьте передать правильные заголовки и тело запроса (логин/пароль)
    // по ответу преобразуйте значения в js-объект и верните его из функции

    // Закомментируйте подготовленный fetch-запрос
    // и напишите "заглушку", которая имитирует ответ с сервера и возвращает объект с токеном
}
